In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [8]:
df = pd.read_excel(r'C:\Users\siwoo\OneDrive\바탕 화면\데이터관련자료\통확실습코드\Restaurant.xlsx')
df.tail()

     Restaurant Quality Rating  Meal Price ($)
295         296           Good              17
296         297           Good              16
297         298           Good              15
298         299      Very Good              38
299         300      Very Good              31

In [ ]:
#사용할 컬럼만 가져오기
df = pd.read_excel(r'C:\Users\siwoo\OneDrive\바탕 화면\데이터관련자료\통확실습코드\Restaurant.xlsx', usecols=[1,2])
df

    Quality Rating  Meal Price ($)
0             Good              18
1        Very Good              22
2             Good              28
3        Excellent              38
4        Very Good              33
..             ...             ...
295           Good              17
296           Good              16
297           Good              15
298      Very Good              38
299      Very Good              31

[300 rows x 2 columns]

In [9]:
conditions = [
                (df['Meal Price ($)']>=10)&(df['Meal Price ($)']<20),
                (df['Meal Price ($)']>=20)&(df['Meal Price ($)']<30),
                (df['Meal Price ($)']>=30)&(df['Meal Price ($)']<40),
                (df['Meal Price ($)']>=40)&(df['Meal Price ($)']<50),
]

options = ['10~19', '20~29', '30~39', '40~49']

df['Group'] = np.select(conditions, options, default='Not Specified')

df

     Restaurant Quality Rating  Meal Price ($)  Group
0             1           Good              18  10~19
1             2      Very Good              22  20~29
2             3           Good              28  20~29
3             4      Excellent              38  30~39
4             5      Very Good              33  30~39
..          ...            ...             ...    ...
295         296           Good              17  10~19
296         297           Good              16  10~19
297         298           Good              15  10~19
298         299      Very Good              38  30~39
299         300      Very Good              31  30~39

[300 rows x 4 columns]

In [11]:
crosstable = pd.crosstab(index=df['Quality Rating'], columns=df['Group'])
crosstable

Group           10~19  20~29  30~39  40~49
Quality Rating
Excellent           2     14     28     22
Good               42     40      2      0
Very Good          34     64     46      6

In [12]:
# 행으로 합계
crosstable['Sum'] = crosstable.sum(axis=1)

crosstable

Group           10~19  20~29  30~39  40~49  Sum
Quality Rating
Excellent           2     14     28     22   66
Good               42     40      2      0   84
Very Good          34     64     46      6  150

In [ ]:
# 열로 합계
crosstable.loc['Sum'] = crosstable.sum(axis=0)

crosstable

Group           10~19  20~29  30~39  40~49  Sum
Quality Rating
Excellent           2     14     28     22   66
Good               42     40      2      0   84
Very Good          34     64     46      6  150
Sum                78    118     76     28  300